Repository: AlexandrovaIrina/Fuzzy_portfolio_selection
Catalog: Fuzzy portfolio selection-omegat.tmx
Source language: en_us
Languages: ru_ru

source: *\ Bo Wang
ru_ru: *\ Бо Ван

source: 1 Introduction
ru_ru: 1 Введение

source: 2 Preliminaries
ru_ru: 2 Предварительные сведения

source: 2.1 Fuzzy set theory
ru_ru: 2.1 Теория нечетких множеств

source: 2.2 Classical three‑way decision theory
ru_ru: 2.2 Теория принятия трехсторонних решений

source: 2.3 Cumulative prospect theory
ru_ru: 2.3 Совокупная теория перспектив

source: 3WD [42], developed from classical rough set theory pro-posed by Pawlak, has aroused great interest in academia and industries related to decision making, rough set [40], granu-lar computing, attribute reduction [45].
ru_ru: 3WD [42], разработанная из теории грубых множеств, предложенной Павляком, вызвала большой интерес в академических кругах и отраслях промышленности, связанных с принятием решений, грубыми множествами [40], гранулированными вычислениями, уменьшением атрибутов [45].

source: 5, two case studies based on real market data are performed to justify the effectiveness of the proposed methods.
ru_ru: 5 демонстрируются два тематических исследования, основанные на реальных рыночных данных, проведенные для обоснования эффективности предложенных методов.

source: 6 is the conclusion of this paper.
ru_ru: 6 представлено заключение доклада.

source: Abstract
ru_ru: Аннотация

source: According to the calculation results, the securities can be classified into the three disjoint areas of 3WD.
ru_ru: В соответствии с результатами вычислений, ценные бумаги можно классифицировать разбиением на три непересекающихся области 3WD.

source: And Mansour [26] noted that securities returns contain many aspects of uncertainty, such as ambiguity and vagueness.
ru_ru: А Мансур [26] отметил, что доходности по ценным бумагам содержат много аспектов неопределенности, таких как двусмысленность (ambiguity) и расплывчатость (vagueness).

source: And for any real number
ru_ru: И для любого действительного числа

source: And in recent years, 3WD has been applied in many fields, includ-ing cost-sensitive learning [13], image recognition [20], cog-nitive concept learning [21], recommendation systems [ 24], medical diagnosis [41] and incremental clustering [43].
ru_ru: И в последние годы 3WD была применена во множестве сфер, включая обучение с учетом издержек классификации [13], распознавание изображений [20], формирование когнитивных понятий [21], рекомендательные системы [ 24], медицинскую диагностику [41] и инкрементную кластеризацию [43].

source: And the action set is given by A = {aP , aB , aN
ru_ru: И набор действий задается как A = {aP , aB , aN

source: And the decision-maker will always choose the one with the highest prospect value among all the available options.
ru_ru: И лицо, принимающее решения, всегда будет останавливаться на решении с наибольшей перспективной ценностью среди всех доступных вариантов.

source: And the gains and losses are not absolute values, but are
ru_ru: И прибыль, и убытки - не абсолютные значения, они

source: And to the best of our knowledge, there are few studies solving the long-term portfolio selection problem considering the above deficiency.
ru_ru: И насколько нам известно, существуют отдельные исследования, решающие проблемы выбора долгосрочных портфелей активов, учитывающие вышеупомянутый недостаток.

source: Based on the Bayesian risk minimiza-tion principle, decision rules of 3WD are generated from three disjoint areas, including acceptance, non-commit-ment and rejection.
ru_ru: Основываясь на принципе минимизации байесовского риска, правила принятия решений для 3WD формируются из трех непересекающихся областей, включающих принятие (acceptance), воздержание (non-commitment) и отказ (rejection).

source: Based on the above analysis, a novel fuzzy portfolio selection model based on 3WD and CPT is proposed in this paper.
ru_ru: Основываясь на вышеприведенном анализе, в этом докладе предлагается новаторская модель нечеткого выбора портфелей активов, основанная на 3WD и CPT.

source: Based on the assump-tion that the investor already holds securities in a long-term investment, the portfolio selection model in this paper is developed by adopting three -way decision (3WD) theory, which is expected to provide comprehensive decision sup-port.
ru_ru: Основываясь на предположении, что уже владеет ценными бумагами в долгосрочной инвестиции, модель выбора портфелей активов в этом докладе разработана путем применения теории принятия трехсторонних решений (three-way decision theory, 3WD), что, как ожидается, обеспечит всестороннюю поддержку принятия решений.

source: Besides, introducing 3WD into portfolio selection can also be expected to hedge against the uncertainties of securi-ties future returns.
ru_ru: Кроме того, можно ожидать, что внедрение 3WD при выборе портфелей активов также позволит застраховаться от неопределенности будущей доходности ценных бумаг.

source: Besides, many studies are based on expected utility theory, which is in conflict with the behavior of some investors and may also lead to over-concentration of capital.
ru_ru: Кроме того, многие исследования основаны на теории ожидаемой полезности, что противоречит поведению некоторых инвесторов, а также может приводить к чрезмерной концентрации капитала.

source: By contrast, the using of 3WD, especially the consider-ation of the boundary operation can better hedge against the
ru_ru: Использование же 3WD, особенно рассматривание граничной операции, напротив, может в определенной степени

source: CPT summarizes the phenomena of loss aver-sion and diminishing sensitivity.
ru_ru: CPT обобщает феномены неприятия потерь и уменьшающейся чувствительности.

source: Different from Markowitz’s model which is based on random variables, Chen [ 3] used fuzzy variables to denote the uncertainty of future return and risk and obtained the optimal asset allocation by fuzzy portfolio optimization.
ru_ru: В отличие от модели Марковица, которая основана на случайных переменных, Чен [ 3] использовал нечеткие переменные для обозначения неопределенности будущей доходности и риска и получил оптимальное распределение активов с помощью нечеткой оптимизации портфелей активов.

source: Each option
ru_ru: Каждый вариант

source: Experimental results dem-onstrate that the using of 3WD in portfolio selection guar-antees the diversity of capital allocation and achieves risk reduction; (2) CPT is used together with EUT to achieve a balance between maximizing the prospect value and expected return.
ru_ru: Экспериментальные результаты демонстрируют, что применение 3WD в выборе портфелей активов гарантирует разнообразие распределения капитала и достигает снижения риска; (2) CPT применяется совместно с EUT для достижения баланса между максимизацией перспективной ценности и ожидаемой доходности.

source: Experimental results justify that the com-bination of CPT and EUT is effective in portfolio selection.
ru_ru: Экспериментальные результаты подтверждают эффективность комбинации CPT и EUT в выборе портфелей активов.

source: Finally, Sect.
ru_ru: Наконец, в разделе

source: Finally, following the classification results, an opti-mal investment decision can be obtained by solving a given portfolio selection model.
ru_ru: Наконец, в соответствии с результатами классификации, оптимальное решение об инвестировании можно получить, решив данную модель выбора портфелей активов.

source: First of all, it is assumed that investors already have position in some securities before the portfolio optimization.
ru_ru: Прежде всего, предполагается, что инвесторы уже имеют позицию по ценным бумагам до начала оптимизации выбора портфелей активов.

source: Following the work of Quiggin [29] and Schmeidler [30], Tversky and Kahneman extended PT to uncertain and risky prospects with a lot of outcomes, and introduced cumulative prospect theory (CPT) [33].
ru_ru: Следуя работе Квиггина [29] и Шмейдлера [30], Тверски и Канеман расширили PT для случая неопределенных и рискованных перспектив со множеством исходов, и представили совокупную теорию перспектив (cumulative prospect theory, CPT) [33].

source: For a long time, EUT has been proved to be effec-tive in portfolio selection [2, 6].
ru_ru: В течение длительного времени EUT доказала свою эффективность при выборе портфелей активов [2, 6].

source: For any real number R ∈ ℜ, the credibility of event r is defined by Liu and Liu [23] as:
ru_ru: Для любого действительного числа R ∈ ℜ, достоверность события r определяется Лю и Лю [23] как:

source: Furthermore, the credibility
ru_ru: Кроме того, мера достоверности

source: Fuzzy portfolio selection based on three‑way decision and cumulative prospect theory
ru_ru: Нечеткий выбор портфелей активов, основанный на теории принятия трехсторонних решений и совокупной теории перспектив

source: However, Kahneman and Tversky found that the decision making behavior of some investors under risk and uncertainty does not fit well with EUT, and these findings became the source of prospect theory (PT) [15].
ru_ru: Однако, Канеман и Тверски обнаружили, что поведение некоторых инвесторов при принятии решений в условиях риска и неопределенности не согласуется с EUT, и эти сведения легли в основу теории перспектив (prospect theory, PT) [15].

source: However, Tversky and Kahneman found out that inves-
ru_ru: Однако, Тверски и Каннеман выяснили, что ожидание

source: However, it’s hard to show the chance level of a fuzzy event occurring for the possibil-ity measure is not self-dual.
ru_ru: Однако, сложно показать уровень вероятности наступления нечеткого события, поскольку мера возможности не является самодвойственной.

source: However, the online portfolio selection strategies are aimed at very-short-term investment problems, i.e., high-frequency
ru_ru: Однако онлайн-стратегии выбора портфелей активов направлены на проблемы очень краткосрочных инвестиций, например, высокочастотной

source: In CPT, it is assumed that the prospect value of a scenario is quantified by the probability weight function and the value function.
ru_ru: В CPT предполагается, что перспективная ценность сценария количественно определяется с помощью весовой функции вероятности и функции ценности.

source: In Ref.
ru_ru: В Источнике

source: In Sect.
ru_ru: В разделе

source: In classical EUT, decision-
ru_ru: В классической EUT лица, -

source: In order to construct a dual measure in fuzzy set theory, Liu and Liu [23] defined the self-dual set function, i.e., credibility measure.
ru_ru: Для построения двойственной меры в теории нечетких множеств, Лю и Лю [23] определили самодвойственную функцию множества, т.н. меру достоверности.

source: In order to describe the randomness and volatil-ity of the securities market, many scholars use random vari-ables or fuzzy variables to forecast the trend of securities returns [1, 17, 31].
ru_ru: Для того, чтобы описать степень случайности и волатильность рынка ценных бумаг, многие исследователи используют случайные или нечеткие переменные для прогнозирования тенденции доходности ценных бумаг [1, 17, 31].

source: In order to describe the volatility and non-statistical fea-ture of the securities market, fuzzy variables have been widely adopted to represent the possible securities returns in the future.
ru_ru: Для того, чтобы описать волатильность и нестатистические признаки рынка ценных бумаг, широкое применение получили нечеткие переменные для представления возможной доходности ценных бумаг в будущем.

source: In recent years, many scholars proposed different return and risk metrics to improve and perfect fuzzy portfolio selec-tion models [11, 12, 19, 34].
ru_ru: В последние годы многие исследователи предлагали различные метрики доходности и риска для улучшения и совершенствования моделей нечеткого выбора портфелей активов [11, 12, 19, 34].

source: In the case of insufficient information, non-commitment is treated as a delayed decision, which is consistent with the human-made decision process.
ru_ru: В случае недостатка информации, воздержание рассматривается как отложенное решение,что соответствует процессу принятия решений человеком.

source: In the fuzzy context, possibility is the most frequently used measure.
ru_ru: В контексте нечеткости, наиболее часто употребляемая мера — это возможность.

source: In this model, every action in the action set to the candidate securities is assigned to a prospect value and we can construct a tri -partition of the candidate securities according to three- way decision theory.
ru_ru: В этой модели каждому действию в наборе действий для ценных бумаг-кандидатов присваивается потенциальная ценность, что делает возможным построить тройное разделение ценных бумаг-кандидатов в соответствии с теорией принятия трехсторонних решений.

source: In this paper, CPT is utilized together with EUT to assess the decision-maker’s preference for each possible outcome.
ru_ru: В этом докладе CPT используется совместно с EUT для оценки предпочтений лиц, принимающих решения, касательно каждого возможного исхода.

source: In this section, some preliminary knowledge of fuzzy set
ru_ru: В этом разделе будут представлены некоторые предварительные

source: Investors will
ru_ru: Инвесторы будут

source: Keywords Fuzzy portfolio selection · Three-way decision · Cumulative prospect theory · Expected utility theory
ru_ru: Ключевые слова Нечеткий выбор портфелей активов · Трехстороннее решение · Совокупная теория перспектив · Теория ожидаемой полезности

source: Liu and Liu [23] also defined the expect value of fuzzy vari-
ru_ru: Лю и Лю [23] также определили ожидаемое значение нечеткой переменной

source: Most of existing studies assumed that the investor has all the cash in hand and no securities position before portfolio optimization, which is sometimes inconsistent to reality.
ru_ru: Большинство существующих исследований предполагают, что перед оптимизацией портфеля активов у инвестора на руках все его наличные, а позиция по ценным бумагам отсутствует, что подчас не соответствует действительности.

source: No matter how advanced the forecasting techniques are, the forecasted results will always contain some subjective elements, such as the selection of probabil-ity distribution/membership function and the estimation of the related parameters like mean and variance.
ru_ru: Независимо от того, насколько продвинуты методы прогнозирования, прогнозируемые результаты всегда будут содержать некоторые субъективные элементы, такие как выбор функции распределения вероятности/принадлежности и оценка связанных параметров, таких как среднее значение и дисперсия.

source: ORIGINAL ARTICLE
ru_ru: ОРИГИНАЛЬНАЯ СТАТЬЯ

source: Over reliance on the forecast results may lead to excessive risk concentration.
ru_ru: Чрезмерная зависимость от результатов прогноза может привести к избыточной концентрации риска.

source: Portfolio selection theory began with Markowitz’s seminal work [27], the core issue of which is to maximize the return or minimize the risk.
ru_ru: Теория выбора портфелей активов началась с основополагающей работы Марковица [27], основным вопросом которой была максимизация доходности или минимизация риска.

source: Received: 3 February 2021 / Accepted: 27 July 2021 / Published online: 9 August 2021
ru_ru: Получена: 3 февраля 2021 / Принята: 27 июля 2021 / Опубликована онлайн: 9 августа 2021

source: School of Finance, Zhongnan University of Economics and Law, Wuhan 430073, China
ru_ru: Школа финансов, Чжуннаньский университет экономики и права, Ухань 430073, Китай

source: School of Information, Production and Systems, Waseda University, Fukuoka 808‑0135, Japan
ru_ru: Школа информации, производства и систем, Университет Васэда, Фукуока 808‑0135, Япония

source: School of Management and Engineering, Nanjing University, Nanjing 210093, China
ru_ru: Школа менеджмента и инжиниринга, Наньцзинский университет, Наньцзин 210093, Китай

source: Sec-tion 2 contains the preliminary knowledge which will be used in this paper.
ru_ru: Раздел 2 описывает предварительные сведения, используемые в этом докладе.

source: Section 3 defines the security classifica-tion rules based on 3WD and CPT.
ru_ru: Раздел 3 определяет правила классификации ценных бумаг, основываясь на 3WD и CPT.

source: Section 4 builds four portfolio selection models and introduces the solution algo-rithm.
ru_ru: Раздел 4 демонстрирует создание четырех моделей выбора портфелей активов и представляет алгоритм решения.

source: Simultaneously, they found that the prob-
ru_ru: Параллельно, они выяснили, что вероятности

source: Since the investor may act out hesitation for insufficient information in capital market, at this time a delayed decision inspired by 3WD might be a better option than the decision made in a hurry.
ru_ru: Поскольку инвестор может проявить нерешительность ввиду недостатка информации на рынке капитала, на этот раз отложенное решение, вдохновленное 3WD, может быть лучшим вариантом, чем решение, принятое в спешке.

source: So it can be seen that the procedures of 3WD match with portfolio selection inherently.
ru_ru: Таким образом, можно видеть, что процедуры 3WD по своей сути совпадают с выбором портфелей активов.

source: Suppose that ξ is a fuzzy variable with membership function (x) .
ru_ru: Предположим, что ξ является нечеткой переменной с функцией членства(x) .

source: Suppose the state set is given by U = { , C},
ru_ru: Предположим набор состояний задается как U = { , C},

source: Suppose there are M
ru_ru: Предположим, есть M

source: Table 1, where PP , BP , NP represent the correspond-
ru_ru: где PP , BP , NP представляют собой

source: Table 1 The loss function
ru_ru: Таблица 1 Матрица функции

source: The
ru_ru: Вероятность

source: The basic concepts and rules of 3WD were introduced by
ru_ru: Основные понятия и правила 3WD представил

source: The credibility measurement is a self-dual function, i.e.,
ru_ru: Мера достоверности — самодвойственная функция, т.е.,

source: The effectiveness of CPT in characterizing investors’ behavior has been verified by large amounts of experiments.
ru_ru: Эффективность CPT при характеризации поведения инвесторов было подтверждено большим количеством экспериментов.

source: The experimented results prove that the using of three-way decision and cumulative prospect theory increases the investment return, meanwhile, reduces the risk for the investor.
ru_ru: Экспериментальные результаты подтвердили, что применение теории принятия трехсторонних решений и совокупной теории перспектив повышает доходность инвестиций и, в то же время, снижает риск для инвестора.

source: The first deficiency is that their models assume that the investor has all the cash in hand and no securities position before the portfolio optimization.
ru_ru: Первый недостаток заключается в том, что их модели предполагают, что перед оптимизацией портфеля активов у инвестора на руках все его наличные, а позиция по ценным бумагам отсутствует.

source: The goal of fuzzy portfolio selection is to make a combination of securities which can maximize the return or minimize the risk.
ru_ru: Цель нечеткого выбора портфеля активов — создать сочетание ценных бумаг, которое может максимизировать доходность или минимизировать риск.

source: The loss functions
ru_ru: Функции потерь

source: The main concept of 3WD is to divide the decision space into three disjoint areas (positive, boundary and negative areas) by means of two thresholds, α and β.
ru_ru: Основной концепт 3WD заключается в разделении пространства решений на три непересекающихся области (положительная (positive), граничная (boundary) и отрицательная (negative) области) с помощью двух пороговых значений, α и β.

source: The major contributions of this paper include the follow-ing: (1) 3WD is considered to handle the inaccurate forecast results of securities returns and the long-term investment problems with securities in hand.
ru_ru: Основной вклад данного доклада включает следующее: (1) 3WD рассматривается как способ справляться с неточными результатами прогнозирования доходности инвестиций и проблемами долгосрочных инвестиций с ценными бумагами на руках.

source: The progresses of artificial intelligence have greatly improved the practical value of online portfolio selection strategies.
ru_ru: Развитие искусственного интеллекта значительно повысило практическую ценность онлайн-стратегий выбора портфелей активов.

source: The remainder of this paper is organized as follows.
ru_ru: Остальная часть этого доклада организована следующим образом.

source: The second deficiency in most existing studies is that they are completely based on expected utility theory (EUT) .
ru_ru: Второй недостаток большинства существующих исследований в том, что они полностью основаны на теории ожидаемой полезности (expected utility theory, EUT).

source: The three-way rules generated by the positive, boundary and negative regions can correspond with the decisions of buy, deferment and sell in portfolio selection.
ru_ru: Трехсторонние правила, сформированные положительной, граничной и отрицательной областями, могут соответствовать решениям о покупке (buy), отсрочке (deferment) и продаже (sell) в выборе портфелей активов.

source: The unavoid-able fact is that these forecasts cannot be always correct and accurate [11 ].
ru_ru: Неизбежным фактом является то, что эти прогнозы не всегда могут быть корректными и точными [11 ].

source: Then the prospect value of the securities for each possible outcome is calculated.
ru_ru: Затем рассчитывается перспективная ценность ценных бумаг для каждого возможного исхода.

source: Therefore, a series of portfolio selection strategies have been proposed to alleviate this deficiency, most of which are online strategies, including following the winner, following the loser, meta-learning, pattern matching, and etc. [18].
ru_ru: Вследствие этого, ряд стратегий выбора портфелей активов предлагает устранить этот недостаток. Причем большинство из них является онлайн-стратегиями, включая следование за победителем, следование за проигравшим, метаобучение, сопоставление с образцом и т.д. [18].

source: Therefore, in this paper, we propose a fuzzy portfolio selection model based on three-way decision and cumulative prospect theory, which can mitigate the two shortcomings mentioned above.
ru_ru: Вследствие этого, в данном докладе, мы предлагаем модель нечеткого выбора портфеля активов, основанную на теории принятия трехсторонних решений и совокупной теории перспектив, что может смягчить два вышеупомянутых недочета.

source: Therefore, it could be meaningful to build a 3WD-based portfolio selection model.
ru_ru: Вследствие этого, может иметь смысл в создании модели выбора портфелей активов на основе 3WD.

source: Therefore, many scholars have used CPT to reveal the risk preference of decision-makers [8, 16, 39].
ru_ru: Вследствие этого, многие исследователи применяли CPT для выявления предпочтений лиц, принимающих решения, касательно риска [8, 16, 39].

source: This assumption may sometimes contradict reality, which hinders the practical application of portfolio selection models to a certain extent.
ru_ru: Это предположение подчас противоречит действительности, что в определенной степени препятствует практическому применению моделей выбора портфелей активов.

source: To provide a rational explanation of why financial deci-
ru_ru: Чтобы предоставлять рациональное объяснение, почему инвесторы делают--

source: To validate the effectiveness of our approach, we adopted two case studies on the basis of real market data.
ru_ru: Для подтверждения эффективности нашего подхода, мы применили его к двум тематическим исследованиям на основе реальных рыночных данных.

source: What’s more, most of exist-ing methods involve only the buying and selling of securi-ties.
ru_ru: Более того, большинство существующих методов включают только покупку и продажу ценных бумаг.
